АлогистикТест2/src/Documents/алк_РемонтИнструмента/алк_РемонтИнструмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РемонтИнструмента</name>
  <attributes>
    <name>ВидРемонтаИнструмента</name>
    <type>
      <types>CatalogRef.алк_ВидРемонтаИнструмента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРемонта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пила</name>
    <type>
      <types>CatalogRef.алк_Пилы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПилы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.алк_Станки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПластин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_РемонтИнструмента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПилаПриИзмененииНаСервере()
                   	
	Объект.Станок = Объект.Пила.Станок;
	Объект.НомерПилы = Объект.Пила.НомерПилы;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПилаПриИзменении(Элемент)
	ПилаПриИзмененииНаСервере();
КонецПроцедуры
